app/controllers/blogs_controller.rb

SELECT * FROM "blogs"
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("updated_at", "title", "content", "created_at") VALUES('2010-05-09 20:10:49.681833', E'Blog One', E'Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One Content One ', '2010-05-09 20:10:49.681833')
---
  def create
    Blog.create(:title => params[:title], :content => params[:content])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def edit
    @blog = Blog.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
UPDATE "blogs" SET "content" = 'This is a long blog. This is a long blog. This is a long blog. This is a long blog. x', "title" = 'Cyrus is cool', "updated_at" = '2010-05-09 19:47:03' WHERE "id" = 1
---
  def update
    @blog = Blog.find(params[:id])
    @blog.update_attributes(params[:blog])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
DELETE FROM "blogs" WHERE "id" = 1
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy

SELECT * FROM "blogs" WHERE ("blogs"."id" = 4)
---
  def show
    @blog = Blog.find(params[:id])