app/controllers/comments_controller.rb

  def create
    blog = Blog.find(params[:blog_id])
    blog.comments << Comment.create(:author => params[:author], :message => params[:message])
---
SELECT * FROM "blogs" WHERE ("blogs"."id" = 2)
INSERT INTO "comments" ("message", "updated_at", "author", "blog_id", "created_at") VALUES(E'You are wrong', '2010-05-09 20:20:17.216418', E'Cyrus', 1, '2010-05-09 20:20:17.216418')